src/main/resources/xml/ResetPassword/ResetPassword_soap1_1-request.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="https://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="https://www.w3.org/2001/XMLSchema"
               xmlns:soap="https://schemas.xmlsoap.org/soap/envelope/">
    <soap:Body>
        <ResetPassword xmlns="https://tempuri.org/">
            <userId>string</userId>
            <mail>string</mail>
            <telephone>string</telephone>
            <preFix>string</preFix>
            <telephoneTypeId>string</telephoneTypeId>
            <username>string</username>
            <password>string</password>
            <programId>string</programId>
        </ResetPassword>
    </soap:Body>
</soap:Envelope>

        <!--        POST /serviceconsulta.asmx HTTP/1.1-->
        <!--        Host: wscabalindividuosdev.cabal.coop-->
        <!--        Content-Type: text/xml; charset=utf-8-->
        <!--        Content-Length: length-->
        <!--        SOAPAction: "https://tempuri.org/ResetPassword"-->

        <!--        HTTP/1.1 200 OK-->
        <!--        Content-Type: text/xml; charset=utf-8-->
        <!--        Content-Length: length-->